In [1]:
import pandas as pd

In [2]:
data=pd.read_csv('data/course_eval.csv')
data.head()

  Instructor    Course Semester  Year  Evaluation
0     Safadi  MIST4610     Fall  2019           5
1      Aguar  MIST6380   Spring  2018           4
2     Safadi  MIST5730   Summer  2018           3
3   Boudreau  MIST4610     Fall  2018           4
4     Safadi  MIST4610   Summer  2017           3

In [3]:
midrow = len(data.index) // 2
midcol = len(data.columns) // 2

`data` is broken to two data frames `first_half` and `second_half`.
Reassemble the data from the two data frames

In [9]:
first_half = data.iloc[:midrow, :]
second_half = data.iloc[midrow:, :]

In [10]:
first_half.shape

(39, 5)

In [11]:
second_half.shape

(39, 5)

In [15]:
data1 = pd.concat([first_half, second_half]) #or, first_half.append(second_half)

`data` is broken to two data frames `first_half` and `second_half`.
Reassemble the data from the two data frames

In [16]:
first_half = data.iloc[:, :midcol]
second_half = data.iloc[:, midcol:]

In [19]:
data2 = pd.concat([first_half, second_half], axis=1)

`data` is broken to four data frames `data1`, `data2`, `data3`, and `data4`.
Reassemble the data from the four data frames

In [21]:
data1 = data.iloc[:midrow, :midcol]
data2 = data.iloc[midrow:, :midcol]
data3 = data.iloc[:midrow, midcol:]
data4 = data.iloc[midrow:, midcol:]

In [24]:
p1 = data1.append(data2)

In [25]:
p2 = data3.append(data4)

In [27]:
data3 = pd.concat([p1, p2], axis = 1)

    Instructor    Course Semester  Year  Evaluation
0       Safadi  MIST4610     Fall  2019           5
1        Aguar  MIST6380   Spring  2018           4
2       Safadi  MIST5730   Summer  2018           3
3     Boudreau  MIST4610     Fall  2018           4
4       Safadi  MIST4610   Summer  2017           3
..         ...       ...      ...   ...         ...
73      Safadi  MIST5730   Summer  2020           4
74    Boudreau  MIST6380   Summer  2020           1
75    Boudreau  MIST4610     Fall  2020           4
76  Srinivasan  MIST6380   Spring  2019           2
77  Srinivasan  MIST6380   Spring  2018           4

[78 rows x 5 columns]